khoih-prog/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_SAMD_WM.h
          //EEPROM.put(EEPROM_START, Blynk8266_WM_config);
          Blynk8266_WM_config_data.write(Blynk8266_WM_config);
                                   
          //BLYNK_LOG2(BLYNK_F("Init new EEPROM, size = "), EEPROM.length());    
          BLYNK_LOG2(BLYNK_F("Write new Data to Flash, size = "), sizeof(Blynk8266_WM_config)); 
                
          // doesn't have any configuration
          strcpy(Blynk8266_WM_config.header,           BLYNK_BOARD_TYPE);
          strcpy(Blynk8266_WM_config.wifi_ssid,        NO_CONFIG);
          strcpy(Blynk8266_WM_config.wifi_pw,          NO_CONFIG);
          strcpy(Blynk8266_WM_config.blynk_server,     NO_CONFIG);
          Blynk8266_WM_config.blynk_port = BLYNK_SERVER_HARDWARE_PORT;
          strcpy(Blynk8266_WM_config.blynk_token,      NO_CONFIG);
          strcpy(Blynk8266_WM_config.board_name,       NO_CONFIG);
          // Don't need
          Blynk8266_WM_config.checkSum = 0;


          //EEPROM.put(EEPROM_START, Blynk8266_WM_config);
          Blynk8266_WM_config_data.write(Blynk8266_WM_config);

          return false;
      }  
      else if ( !strncmp(Blynk8266_WM_config.wifi_ssid,       NO_CONFIG, strlen(NO_CONFIG))   ||
                !strncmp(Blynk8266_WM_config.wifi_pw,         NO_CONFIG, strlen(NO_CONFIG) )  ||
                !strncmp(Blynk8266_WM_config.blynk_server,    NO_CONFIG, strlen(NO_CONFIG) )  ||
                !strncmp(Blynk8266_WM_config.blynk_token,     NO_CONFIG, strlen(NO_CONFIG) ) ) 
      {
        // If SSID, PW, Server,Token ="nothing", stay in config mode forever until having config Data.
        return false;
      }  
      else
      {
        displayConfigData();               
      }
      
      return true;
    }
    
    void saveConfigData()
    {         
      int calChecksum = calcChecksum();
      Blynk8266_WM_config.checkSum = calChecksum;
     //BLYNK_LOG4(BLYNK_F("Save EEPROM, size = "), EEPROM.length(), BLYNK_F(", chkSum = "), calChecksum);
      BLYNK_LOG4(BLYNK_F("Save Data, size = "), sizeof(Blynk8266_WM_config), BLYNK_F(", chkSum = "), calChecksum);
      
      //EEPROM.put(EEPROM_START, Blynk8266_WM_config);
      Blynk8266_WM_config_data.write(Blynk8266_WM_config);
    }
		
    boolean connectToWifi(int timeout)
    {
      int sleep_time = 250;
      unsigned long currMillis = millis();

	    BLYNK_LOG1(BLYNK_F("con2WF: start"));
	    
	    // New from Blynk_WM v1.0.5
      if (static_IP != IPAddress(0, 0, 0, 0))
      {
        BLYNK_LOG1(BLYNK_F("Use static IP"));
        wifi->setStationIp(IPAddressToString(static_IP), IPAddressToString(static_GW), IPAddressToString(static_SN));       
      }
	
      while ( !wifi_connected && ( 0 < timeout ) && ( (millis() - currMillis) < (unsigned long) timeout )  )
      {
          BLYNK_LOG2(BLYNK_F("con2Wifi: Try conWiFi, spent millis = "), millis() - currMillis);
          
          if (connectWiFi(Blynk8266_WM_config.wifi_ssid, Blynk8266_WM_config.wifi_pw))
          {
            wifi_connected = true;
          }
          else
          {
            delay(sleep_time);
            timeout -= sleep_time;
          }
      }          

	    if (wifi_connected)
	    {
		    BLYNK_LOG1(BLYNK_F("con2WF: con OK"));
		    displayWiFiData();
		  }
	    else
	    {
		    BLYNK_LOG1(BLYNK_F("con2WF: con failed"));
		  }
	
      return wifi_connected;    
    }
    
    void handleRequest()
    {
      if (server)
      {
        String key    = server->arg("key");
        String value  = server->arg("value");
        
        static int number_items_Updated = 0;

        if (key == "" && value == "") 
        {
            String result = root_html_template;

            BLYNK_LOG1(BLYNK_F("hR: replace result"));
            
            // Reset configTimeout to stay here until finished.
            configTimeout = 0;

            result.replace("[[wf_id]]",     Blynk8266_WM_config.wifi_ssid);
            result.replace("[[wf_pw]]",     Blynk8266_WM_config.wifi_pw);
            result.replace("[[b_svr]]",     Blynk8266_WM_config.blynk_server);
            result.replace("[[b_pt]]",      String(Blynk8266_WM_config.blynk_port));
            result.replace("[[b_tok]]",     Blynk8266_WM_config.blynk_token);
            result.replace("[[bd_nm]]",     Blynk8266_WM_config.board_name);

            server->send(200, "text/html", result);

            return;
        }
        
        if (number_items_Updated == 0)
        {
          memset(&Blynk8266_WM_config, 0, sizeof(Blynk8266_WM_config));
          strcpy(Blynk8266_WM_config.header, BLYNK_BOARD_TYPE);
        }
        
        if (key == "wf_id")
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.wifi_ssid) -1)
              strcpy(Blynk8266_WM_config.wifi_ssid, value.c_str());
            else
              strncpy(Blynk8266_WM_config.wifi_ssid, value.c_str(), sizeof(Blynk8266_WM_config.wifi_ssid) -1);    
        }
        else if (key == "wf_pw") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.wifi_pw) -1)
              strcpy(Blynk8266_WM_config.wifi_pw, value.c_str());
            else
              strncpy(Blynk8266_WM_config.wifi_pw, value.c_str(), sizeof(Blynk8266_WM_config.wifi_pw) -1);    
        }

        else if (key == "b_svr") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.blynk_server) -1)
              strcpy(Blynk8266_WM_config.blynk_server, value.c_str());
            else
              strncpy(Blynk8266_WM_config.blynk_server, value.c_str(), sizeof(Blynk8266_WM_config.blynk_server) -1);      
        }
        else if (key == "b_pt") 
        {
            number_items_Updated++;
            Blynk8266_WM_config.blynk_port = value.toInt();
        }
        else if (key == "b_tok") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.blynk_token) -1)
              strcpy(Blynk8266_WM_config.blynk_token, value.c_str());
            else
              strncpy(Blynk8266_WM_config.blynk_token, value.c_str(), sizeof(Blynk8266_WM_config.blynk_token) -1);    
        }
        else if (key == "bd_nm") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.board_name) -1)
              strcpy(Blynk8266_WM_config.board_name, value.c_str());
            else
              strncpy(Blynk8266_WM_config.board_name, value.c_str(), sizeof(Blynk8266_WM_config.board_name) -1);  
        }

