khoih-prog/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_SAMD_WM.h
        server->send(200, "text/html", "OK");
        
        if (number_items_Updated == NUM_CONFIGURABLE_ITEMS)
        {
          //BLYNK_LOG1(BLYNK_F("hR: Update EEPROM"));
          BLYNK_LOG1(BLYNK_F("hR: Update Flash"));

          saveConfigData();

          BLYNK_LOG1(BLYNK_F("hR: Reset"));
          
          // TO DO : what command to reset
          // Delay then reset the board after save data
          delay(1000);
          resetFunc();  //call reset
        }
      }   // if (server)
    }
        
    void startConfigurationMode()
    {     
      #define CONFIG_TIMEOUT			60000L
                	
      // initialize ESP module
      WiFi.init(wifi->getUart());
      WiFi.configAP(portal_apIP);
      
      if ( (portal_ssid == "") || portal_pass == "" )
      {            
        String randomNum = String(random(0xFFFFFF), HEX);
        randomNum.toUpperCase();
        
        portal_ssid = "SAMD_" + randomNum;
        portal_pass = "MySAMD_" + randomNum;
      }
           	    
      BLYNK_LOG6(BLYNK_F("startConfig: SSID = "), portal_ssid, BLYNK_F(", PW = "), portal_pass, BLYNK_F(", IP = "), portal_apIP);

      // start access point, AP only, channel 10
      int AP_channel = 10;
      WiFi.beginAP(portal_ssid.c_str(), AP_channel, portal_pass.c_str(), ENC_TYPE_WPA2_PSK, true);
      
      if (!server)
      {      
	      server = new ESP8266_AT_WebServer;
	    }
      
      // Don't know if it's working or not. Can we use ESP8266_Lib wifi TCP server for this ??
      
      //See https://stackoverflow.com/questions/39803135/c-unresolved-overloaded-function-type?rq=1
      
      if (server)
      {
        server->on("/", [this](){ handleRequest(); });
        server->begin();
      }

      // If there is no saved config Data, stay in config mode forever until having config Data.
      // or SSID, PW, Server,Token ="nothing"
      if (hadConfigData)
        configTimeout = millis() + CONFIG_TIMEOUT;                        
      else
        configTimeout = 0;
               
      configuration_mode = true;    
    }    
    
};


static BlynkTransportShieldEsp8266 _blynkTransport;
BlynkWifi Blynk(_blynkTransport);

#include <BlynkWidgets.h>

#endif
